Repository: vfrcbv2142/glpi-singlesignon-cit
Catalog: locales/*.po
Languages: de_de, es_es, pt_br

source: Please, rename the plugin folder "%s" to "singlesignon"
de_de: Bitte benenne das Plugin Verzeichnis von "%s" in "singlesignon" um.
es_es: Por favor, cambie el nombre de la carpeta del plugin "%s" para "singlesignon"
pt_br: Por favor, renomeie a pasta do plugin "%s" para "singlesignon"

source: Single Sign-on
pt_br: Logon Único

source: This plugin requires GLPI >= 0.85
de_de: Das Plugin benötigt mindestens GLPI Version 0.85
es_es: Este plugin requiere GLPI >= 0.85
pt_br: Este plugin requer GLPI >= 0.85

source: Provider not defined.
de_de: Provider nicht definiert.
es_es: Proveedor no definido.
pt_br: Provedor não definido.

source: Provider not found.
de_de: Provider nicht gefunden.
es_es: Proveedor no encontrado.
pt_br: Provedor não encontrado.

source: Provider not active.
de_de: Provider nicht aktiv.
es_es: Proveedor no activado.
pt_br: Provedor não ativo.

source: Automatic redirection, else click
pt_br: Redirecionamento automático, caso contrário, clique

source: Single Sign-on Provider
es_es: Proveedor de Single Sign-on
pt_br: Provedor de Logon Único

source: Linked accounts
de_de: Verlinkte Accounts
es_es: Cuentas vinculadas
pt_br: Contas vinculadas

source: JSON SSO provider representation
pt_br: Representação do provedor SSO em JSON

source: Copy provider information
pt_br: Copiar informação do provedor

source: SSO Type
de_de: SSO Typ
es_es: Tipo de SSO
pt_br: Tipo SSO

source: Client ID
es_es: Identificación del cliente
pt_br: ID de Cliente

source: Client Secret
es_es: Secreto del cliente
pt_br: Segredo do Cliente

source: Scope
es_es: Alcance
pt_br: Escopo

source: Extra Options
de_de: Weitere Optionen
es_es: Opciones adicionales
pt_br: Opções Extras

source: Allows you to specify custom parameters for the SSO provider %1$s. Example: %2$s to force login or %3$s to force account selection (supported URL settings may vary by provider). You can specify additional parameters with the "&" delimiter.
pt_br: Permite especificar parâmetros personalizados para a %1$s do provedor de SSO. Exemplo: %2$s para forçar o login ou %3$s para forçar a seleção de conta (as configurações de URL suportadas podem variar de acordo com o provedor). Você pode especificar parâmetros adicionais com o delimitador "&".

source: Authorize URL
de_de: URL Autorisierung
es_es: URL de autorización
pt_br: URL de Autorização

source: Access Token URL
de_de: URL Access Token
es_es: URL del token de acceso
pt_br: URL de Token de Acesso

source: Resource Owner Details URL
de_de: URL Benutzerinfornmationen
es_es: URL de detalles del propietario del recurso
pt_br: URL de Detalhes do Proprietário do Recurso

source: IsDefault
de_de: Ist Standard
pt_br: É Padrão

source: PopupAuth
pt_br: Autenticação Pop-up

source: SplitDomain
de_de: Domäne abtrennen
pt_br: Dividir Domínio

source: AuthorizedDomains
de_de: Erlaubte Domänen
pt_br: Domínios Autorizados

source: Provide a list of domains allowed to log in through this provider (separated by commas, no spaces) (optional).
pt_br: Forneça uma lista de domínios permitidos para fazer login por meio deste provedor (separados por vírgulas, sem espaços) (opcional).

source: Use Email as Login
de_de: E-Mail als Login benutzen
pt_br: Usar E-mail como Login

source: Split Name
de_de: Name abtrennen
pt_br: Dividir Nome

source: Callback URL
es_es: URL de devolución de llamada
pt_br: URL de Retorno

source: Test Single Sign-on
de_de: Teste Single Sign-on
es_es: Pruebar Single Sign-on
pt_br: Testar Logon Único

source: A Name is required
de_de: Es wird ein Name benötigt.
es_es: Se requiere un nombre
pt_br: O Nome é obrigatório

source: The "%s" is a Invalid type
de_de: Der Typ "%s" ist nicht gültig
es_es: El "%s" es un tipo no válido
pt_br: O "%s" é um tipo inválido

source: A Client ID is required
de_de: Eine Client ID ist notwendig
es_es: Se requiere una identificación de cliente
pt_br: O ID de Cliente é obrigatório

source: A Client Secret is required
de_de: Ein Client Secret ist notwendig
es_es: Se requiere un secreto de cliente
pt_br: O Segredo do Cliente é obrigatório

source: An Authorize URL is required
de_de: Eine Autorisierungs URL ist notwendig
es_es: Se requiere una URL de autorización
pt_br: A URL de Autorização é obrigatória

source: The Authorize URL is invalid
de_de: Die Autorisierungs URL ist nicht gültig
es_es: La URL de autorización no es válida
pt_br: A URL de Autorização é inválida

source: An Access Token URL is required
de_de: Eine Access Token URL ist notwendig
es_es: Se requiere una URL de token de acceso
pt_br: A URL de Token de Acesso é obrigatória

source: The Access Token URL is invalid
de_de: Die Access Token URL ist nicht gültig
es_es: La URL del token de acceso no es válida
pt_br: A URL de Token de Acesso é inválida

source: A Resource Owner Details URL is required
de_de: Eine Benutzerinfornmationen URL ist notwendig
es_es: Se requiere una URL de detalles del propietario del recurso
pt_br: A URL de Detalhes do Proprietário do Recurso é obrigatória

source: The Resource Owner Details URL is invalid
de_de: Die Benutzerinfornmationen URL ist nicht gültig
es_es: La URL de detalles del propietario del recurso no es válida
pt_br: A URL de Detalhes do Proprietário do Recurso é inválida

source: Generic
de_de: Generisch
es_es: Genérico
pt_br: Genérico

source: Login with %s
de_de: Login mit %s
es_es: Iniciar con %s
pt_br: Entrar com %s
